#Напишите выражение, результат которого равен 12.
# Можете использовать более одного оператора: два сложения,
# три вычитания, это не имеет значения.
print(10+2)